#include <std_lib_facilities.h>

void my_error (string error_str)
{
	try		{ throw 'e'; }
	
	catch (...) {
		cerr << "Ошибка: " << error_str << '\n';
		
		while (cin.get() != '\n') cin.clear(); //Очищает поток символов cin
		
		keep_window_open("~~");
		exit;
	}
}

double common_check (const vector<double>& price, const vector<double>& count)
//вычисляет сумму произведений двух параллельных значений векторов (цена*кол-во_товара)
//На вход: константные ссылки на 2 непустых вектора равных по размерам
//Возврат: сумма произведений двух параллельных значений векторов (price[i]*count[i])
{
	if (price.size()==0 || count.size()==0)
		my_error ("пустой вектор!!!");
	else if (price.size() != count.size())
		my_error ("размеры векторов 'цена' и 'кол-во (вес) товара' не равны!!!");
		
	double summ = 0;
	for (int i = 0;  i < price.size(); ++i)
		summ += price[i]*count[i];
		
	if (isinf(summ))
		my_error ("общая сумма чека вышла за пределы типа DOUBLE!!!");
	else return summ;
}

//------------------------------------------------------------------------------

void print_vdouble(const vector<double>& v, const string& s)
//На вход константные ссылки на вектор и строку
//Вывод на экран строку в виде: "ПЕРЕДАННАЯ_СТРОКА (РАЗМЕР_ВЕКТОРА):"
//и далее каждый элемент вектора: [�?НДЕКС] ЭЛЕМЕНТ_ВЕКТОРА
{
	cout << s << " (" << v.size() << "): " << endl;
	
	for (int i = 0;  i < v.size(); ++i)
		if ( i < (v.size()-1) ) cout << "[" << i << "] " << v[i] << endl;
		else					cout << "[" << i << "] " << v[i] << "\n\n";
}

//------------------------------------------------------------------------------

void print_vint(const vector<int>& v, const string& s)
//На вход константные ссылки на вектор и строку
//Вывод на экран строку в виде: "ПЕРЕДАННАЯ_СТРОКА (РАЗМЕР_ВЕКТОРА):"
//и далее каждый элемент вектора: [�?НДЕКС] ЭЛЕМЕНТ_ВЕКТОРА
{
	cout << s << " (" << v.size() << "): " << endl;
	
	for (int i = 0;  i < v.size(); ++i)
		if ( i < (v.size()-1) ) cout << "[" << i << "] " << v[i] << endl;
		else					cout << "[" << i << "] " << v[i] << "\n\n";
}

void print_vstr(const vector<string>& v, const string& s)
//На вход константные ссылки на вектор и строку
//Вывод на экран строку в виде: "ПЕРЕДАННАЯ_СТРОКА (РАЗМЕР_ВЕКТОРА):"
//и далее каждый элемент вектора: [�?НДЕКС] ЭЛЕМЕНТ_ВЕКТОРА
{
	cout << s << " (" << v.size() << "): " << endl;
	
	for (int i = 0;  i < v.size(); ++i)
		if ( i < (v.size()-1) ) cout << "[" << i << "] " << v[i] << endl;
		else					cout << "[" << i << "] " << v[i] << "\n\n";
}

//------------------------------------------------------------------------------

vector<int> vector_int1 (vector<int> v)
{
	int mid = int(v.size()/2);
	//срединный элемент (или 1ый срединный если четное кол-во эл. в векторе)
	//при счете порядковых номеров от 1
	
	for (int i = 0;  i < mid; ++i)
		swap(v[i],v[v.size()-i-1]);
		
	return v;
}

void vector_int2 (vector<int>& v)
{
	int mid = int( (v.size()/2) - 1);
	//срединный элемент (или 1ый срединный если четное кол-во эл. в векторе)
	//при счете порядковых номеров от 0
	
	for (int i = 0;  i <= mid; ++i)
		swap(v[i],v[v.size()-i-1]);
}

//------------------------------------------------------------------------------

vector<string> vector_str1 (vector<string> v)
{
	int mid = int(v.size()/2);
	//срединный элемент (или 1ый срединный если четное кол-во эл. в векторе)
	//при счете порядковых номеров от 1
	
	for (int i = 0;  i < mid; ++i)
		swap(v[i],v[v.size()-i-1]);
		
	return v;
}

void vector_str2 (vector<string>& v)
{
	int mid = int( (v.size()/2) - 1);
	//срединный элемент (или 1ый срединный если четное кол-во эл. в векторе)
	//при счете порядковых номеров от 0
	
	for (int i = 0;  i <= mid; ++i)
		swap(v[i],v[v.size()-i-1]);
}

//------------------------------------------------------------------------------

vector<double> vector_double1 (vector<double> v)
{
	int mid = int(v.size()/2);
	//срединный элемент (или 1ый срединный если четное кол-во эл. в векторе)
	//при счете порядковых номеров от 1
	
	for (int i = 0;  i < mid; ++i)
		swap(v[i],v[v.size()-i-1]);
		
	return v;
}

void vector_double2 (vector<double>& v)
{
	int mid = int( (v.size()/2) - 1);
	//срединный элемент (или 1ый срединный если четное кол-во эл. в векторе)
	//при счете порядковых номеров от 0
	
	for (int i = 0;  i <= mid; ++i)
		swap(v[i],v[v.size()-i-1]);
}

//------------------------------------------------------------------------------
