//Данная программа решает квадратные уравнения

#include <yes_or_no.h>
#include <console_encoding.h>
#include <std_lib_facilities.h>


int main()
{
	ConsoleCP cp {};	//Включает русский если не включен в настройках компилятора
	
	cout << "Данная программа решает квадратные уравнения (a*x^2 + b*x + c = 0)"
		 << "\n\nВводите аргументы (a, b и c), после ввода каждого нажимая Ente"
		 << "r. Десятичную часть стоит отделять ТОЧКОЙ.\n\nДля завершения работ"
		 << "ы программы нажмите комбинацию CTRL+Z и затем Enter (то же сделает"
		 << " ввод любого символа отличного от числа)\n\n";
	
	double a = 3254799.3254799, b = 3254799.3254799, c = 3254799.3254799, x1 = 0, x2 = 0, D = 0;
	//Число 3254799.3254799 означает. что в данную переменную ввод не производился 
	//(т.к. пользоваель может ввести 0, его не ставим как признак пустой переменной)
	
	cout << "Введите a: ";
	
	for (double one_num; cin >> one_num; ) {
		if (one_num == 0 && a == 3254799.3254799)
			cout << "\nУ данного уравнения не будет корней, т.к. вы ввели a = 0"
				 << ", на ноль как известно делить нельзя "
				 << "(X = (-b +- кор.кв.(D)) / (2*a))\n\nВведите a: ";
		else if (a == 3254799.3254799) {
			a = one_num;
			cout << "Введите b: ";
		}
		else if (b == 3254799.3254799) {
			b = one_num;
			cout << "Введите c: ";
		}
		else if (c == 3254799.3254799) {
			c = one_num;
			
			D = b*b - 4*a*c;
			
			if (D < 0) {
				/*cout << "У уравнения " << a << "x^2 + " << b << "x + " << c 
					 << " = 0  корней нет.";*/
				cout << "\nУ уравнения " << a << "x^2 ";
				
				if (b >= 0) cout << "+ " << b << "x ";
				else cout << "- " << b*(-1) << "x ";
				
				if (c >= 0) cout << "+ " << c << " = 0  корней нет.\t D = " << D;
				else cout << "- " << c*(-1) << " = 0  корней нет.\t D = " << D;
			}
			else if (D == 0) {
				x1 = (-b) / (2*a);
				/*cout << "Уравнение " << a << "x^2 + " << b << "x + " << c 
					 << " = 0  имеет ОДИН единственный корень Х = " << x1;*/
				
				cout << "\nУравнение " << a << "x^2 ";
				
				if (b >= 0) cout << "+ " << b << "x ";
				else cout << "- " << b*(-1) << "x ";
				
				if (c >= 0) cout << "+ " << c;
				else cout << "- " << c*(-1);
				
				cout << " = 0  имеет ОДИН единственный корень Х = " << x1
					 << ";\t D = " << D;
			}
			else if (D > 0) {
				x1 = (-b - sqrt(D)) / (2*a);
				x2 = (-b + sqrt(D)) / (2*a);
				/*cout << "Уравнение " << a << "x^2 + " << b << "x + " << c 
					 << " = 0  имеет ДВА корня Х1 = " << x1 << "; X2 = " << x2;*/
					 
				cout << "\nУравнение " << a << "x^2 ";
				
				if (b >= 0) cout << "+ " << b << "x ";
				else cout << "- " << b*(-1) << "x ";
				
				if (c >= 0) cout << "+ " << c;
				else cout << "- " << c*(-1);
				
				cout << " = 0  имеет ДВА корня Х1 = " << x1 << "; X2 = " << x2
					 << ";\t D = " << D;
			}
			
			a = 3254799.3254799;
			b = a;
			c = a;
			x1 = 0;
			x2 = 0;
			D = 0; //Обнуляем все переменные
			
			cout << "\n\n\nВведите a: ";
		}
	}
	
	cout << "\n\n";
	
	press_Enter_key();
	return EXIT_SUCCESS;
}
