1. Напишите программу, вычисляющую сумму всех целых чисел, записанных в файле и разделенных пробелами.

2. Напишите программу, создающую файл из данных, записанных в виде объектов класса Reading, определенного в разделе 10.5. Для проверки заполните файл как минимум 50 показаниями температуры. Назовите эту программу store_temps.cpp, а создаваемый файл - raw_temps.txt.

3. Напишите программу, считывающую данные из файла raw_temps.txt, созданного в упр.2, в вектор, а затем вычислите среднее значение и медиану температур. Назовите программу temp_stats.срр.

4. Модифицируйте программу store_temps.cpp из упр.2, включив в нее суффикс с для шкалы Цельсия и суффикс f для шкалы Фаренгейта. Затем модифицируйте программу temp_stats.cpp, чтобы перед записью в вектор она проверяла каждое показание и преобразовывала температуру в градусах Цельсия в градусы Фаренгейта.

5. Напишите функцию print_year(), упомянутую в разделе 10.11.2. (ФАЙЛ "ymdht.txt" лежит рядом с исходником задачи)

6. Определите класс Roman_int для хранения римских цифр (как чисел типа int) с операторами << и >>. Включите в класс Roman_int функцию as_int(), возвращающую значение типа int, так, чтобы, если объект r имеет тип Roman_int, мы могли написать cout << "Римское " << r << " равно " << r.as_int() << '\n';. (ФАЙЛ "input.txt" лежит рядом с исходниками задачи)

7. Разработайте вариант калькулятора из главы 7, который работал бы не с арабскими, а с римскими цифрами, например, XXI + CIV == CXXV.

8. Напишите программу, принимающую на вход имена двух файлов и создающую новый файл, в котором за содержимым первого файла следует содержимое второго; иначе говоря, программа должна конкатенировать два файла. (ФАЙЛЫ "first.txt" и "second.txt" лежат рядом с исходником задачи)

9. Напишите программу, принимающую на вход два файла, содержащие лексикографически упорядоченные слова, разделенные пробелами, и объедините их, сохранив упорядочение. (ФАЙЛЫ "first.txt" и "second.txt" лежат рядом с исходником задачи)

10. Добавьте в калькулятор из главы 7 команду from х, осуществляющую ввод данных из файла х. Добавьте в калькулятор команду to у, выполняющую вывод (как обычных данных, так и сообщений об ошибках) в файл у. Напишите набор тестов, основанных на идеях из раздела 7.3, и примените его для проверки калькулятора. Объясните, как использовать эти команды для тестирования. (ФАЙЛЫ "input.txt" и "bigtest.txt" лежат рядом с исходниками задачи)

11. Напишите программу, вычисляющую сумму всех целых чисел, хранящихся в текстовом файле и разделенных пробелами и словами. Например, строка "bears: 17 elephants 9 end" дает результат, равный 26. (ФАЙЛ "input.txt" лежит рядом с исходником задачи)