
#include <yes_or_no.h>
#include <console_encoding.h>
#include <std_lib_facilities.h>

//------------------------------------------------------------------------------

ConsoleCP cp {};	//Включает русский если не включен в настройках компилятора

//------------------------------------------------------------------------------

const string quit_question = "Закрыть программу?";

//------------------------------------------------------------------------------------------------------------

int main() {
	while(true)
	try {
		cout << "\nВвод-вывод ЦЕЛЫХ чисел в разных системах счисления:\n\n"
				"Введите 4 числа:\n"
				"dec \thex \toct \toct \n";
		
		int a, b, c, d;
		
		
		//Данные для тестов:
		//	1234	1234	1234	1234
		//	1234	4d2		2322	2322
		//	1234	4D2		2322	2322
		//	15		15		15		15
		//	F		F		F		F
		//	0		21		13		13
		cin >> dec >> a >> hex >> b >> oct >> c >> d;
		cout << showbase << a << '\t' << b << '\t' << c << '\t' << d << '\n';	//Вывод в десятичной системе счисления
		cout << noshowbase << a << '\t' << b << '\t' << c << '\t' << d << '\n';	//Вывод в десятичной системе счисления
		
		
		if ( Y_or_N(quit_question) )	return 0;
		//keep_window_open("~~");
	}
	
	catch (exception& e) { //Для системных исключений при работе с программой
		cerr << "Ошибка: " << e.what() << '\n';
		
		if ( Y_or_N(quit_question) )	return 1001;
	}

	catch (...) { //Для непредвиденных исключений
		cerr << "Упс! Неизвестное исключение!\n";
		
		if ( Y_or_N(quit_question) )	return 1002;
	}
}