//Данная программа решает квадратные уравнения

#include <yes_or_no.h>
#include <console_encoding.h>
#include <std_lib_facilities.h>


int main()
{
	ConsoleCP cp {};	//Включает русский если не включен в настройках компилятора
	
	cout << "Данная программа решает квадратные уравнения (a*x^2 + b*x + c = 0)"
		 << "\n\nВводите аргументы (a, b и c), после ввода каждого нажимая Ente"
		 << "r. Десятичную часть стоит отделять ТОЧКОЙ.\n\nДля завершения работ"
		 << "ы программы нажмите комбинацию CTRL+Z и затем Enter (то же сделает"
		 << " ввод любого символа отличного от числа)\n\n";
	
	double a = -1, b = -1, c = -1, x1 = 0, x2 = 0, D = 0;
	
	cout << "\n\nВведите аргументы квадратного уравнения (a*x^2 + b*x + c = 0) a, b и c:\n";
	
	while (cin >> a >> b >> c) {
		if (a == 0)
			cout << "\nУ данного уравнения не будет корней, т.к. вы ввели a = 0, на ноль, "
				 << "как известно, делить нельзя \n\t(X = (-b +- кор.кв.(D)) / (2*a))\n\n";
		else {
			D = b*b - 4*a*c;
			
			if (D < 0) {
				/*cout << "У уравнения " << a << "x^2 + " << b << "x + " << c 
					 << " = 0  корней нет.";*/
				cout << "\nУ уравнения " << a << "x^2 ";
				
				if (b >= 0) cout << "+ " << b << "x ";
				else cout << "- " << b*(-1) << "x ";
				
				if (c >= 0) cout << "+ " << c << " = 0  корней нет.\t D = " << D;
				else cout << "- " << c*(-1) << " = 0  корней нет.\t D = " << D;
			}
			else if (D == 0) {
				x1 = (-b) / (2*a);
				/*cout << "Уравнение " << a << "x^2 + " << b << "x + " << c 
					 << " = 0  имеет ОДИН единственный корень Х = " << x1;*/
				
				cout << "\nУравнение " << a << "x^2 ";
				
				if (b >= 0) cout << "+ " << b << "x ";
				else cout << "- " << b*(-1) << "x ";
				
				if (c >= 0) cout << "+ " << c;
				else cout << "- " << c*(-1);
				
				cout << " = 0  имеет ОДИН единственный корень Х = " << x1
					 << ";\t D = " << D;
			}
			else if (D > 0) {
				x1 = (-b - sqrt(D)) / (2*a);
				x2 = (-b + sqrt(D)) / (2*a);
				/*cout << "Уравнение " << a << "x^2 + " << b << "x + " << c 
					 << " = 0  имеет ДВА корня Х1 = " << x1 << "; X2 = " << x2;*/
					 
				cout << "\nУравнение " << a << "x^2 ";
				
				if (b >= 0) cout << "+ " << b << "x ";
				else cout << "- " << b*(-1) << "x ";
				
				if (c >= 0) cout << "+ " << c;
				else cout << "- " << c*(-1);
				
				cout << " = 0  имеет ДВА корня Х1 = " << x1 << "; X2 = " << x2
					 << ";\t D = " << D;
			}
			
			a = 0;	b = 0;	c = 0;	x1 = 0;	x2 = 0;	D = 0; //Обнуляем все переменные
		}
			
		cout << "\n\nВведите аргументы квадратного уравнения (a*x^2 + b*x + c = 0) a, b и c:\n";
	}
	
	cout << "\n\n";
	
	press_Enter_key();
	return EXIT_SUCCESS;
}
