1. Напишите программу с именем Test_output.cpp. Объявите в ней целочисленную переменную birth_year и присвойте ей год своего рождения.

2. Выведите переменную birth_year в десятичном, шестнадцатеричном и восьмеричном виде.

3. Укажите основание системы счисления для каждого выводимого числа.

4. Выровняли ли вы результаты по столбцам с помощью символа табуляции? Если нет, то сделайте это.

5. Теперь выведите свой возраст.

6. Были ли какие-то проблемы? Что произошло? Замените свой вывод десятичным.

7. Вернитесь к п.2 и укажите основания используемой системы счисления для каждого вывода.

8. Попытайтесь прочитать данные как восьмеричные, шестнадцатеричные и т.д.

cin >> а >> oct >> b >> hex >> с >> d;
cout << а << '\t' << b << '\t' << с << '\t' << d << '\n';

Запустите программу со следующими входными данными: 1234 1234 1234 1234 Поясните полученные результаты.

9. Напишите программу, три раза выводящую на печать число 1234567.89: сначала в формате defaultfloat, затем - в fixed и в scientific. Какой способ представления обеспечивает наибольшую точность? Почему?

10. Создайте простую таблицу, содержащую фамилию, имя, телефонный номер и адрес электронной почты хотя бы пяти ваших друзей. Поэкспериментируйте с разной шириной полей, пока не найдете приемлемый.